; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v6 - type_1 ?v4 - type_2)
 	      (pred_3 ?v3 - object ?v4 - type_2)
	      (pred_2 ?v6 - type_1 ?v1 - type_3)
	      (pred_1 ?v6 - type_1 ?v3 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v6 - type_1 ?v7 ?v2 - type_2)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v2)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_1 ?v5 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v8) (pred_4 ?v6 ?v8) (pred_2 ?v6 ?v1))
       :effect (and (pred_1 ?v6 ?v5 ?v1)
		    (not (pred_3 ?v5 ?v8)) 
		    (not (pred_2 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_1 ?v5 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v5 ?v1) (pred_4 ?v6 ?v8))
       :effect (and (pred_3 ?v5 ?v8)
		    (pred_2 ?v6 ?v1)
		    (not (pred_1 ?v6 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_12 - type_1
obj_13 obj_01 obj_04 obj_02 - type_3
obj_06 obj_08 obj_03 obj_07 - type_2
obj_14 obj_09 obj_10 obj_11 - object)
(:init
(pred_4 obj_05 obj_06)
(pred_2 obj_05 obj_13)
(pred_2 obj_05 obj_01)
(pred_4 obj_12 obj_07)
(pred_2 obj_12 obj_04)
(pred_2 obj_12 obj_02)
(pred_3 obj_14 obj_03)
(pred_3 obj_09 obj_06)
(pred_3 obj_10 obj_06)
(pred_3 obj_11 obj_03)
)
(:goal
(and
(pred_3 obj_14 obj_06)
(pred_3 obj_09 obj_03)
(pred_3 obj_10 obj_07)
(pred_3 obj_11 obj_06)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_03)))
)
)

; plan
1. (op_3 obj_05 obj_09 obj_06 obj_01)
   deleted: (pred_3 obj_09 obj_06) (pred_2 obj_05 obj_01)
   added: (pred_1 obj_05 obj_09 obj_01)
   goals met: 0 of 4
2. (op_1 obj_12 obj_07 obj_06)
   deleted: (pred_4 obj_12 obj_07)
   added: (pred_4 obj_12 obj_06)
   goals met: 0 of 4
3. (op_3 obj_12 obj_10 obj_06 obj_02)
   deleted: (pred_3 obj_10 obj_06) (pred_2 obj_12 obj_02)
   added: (pred_1 obj_12 obj_10 obj_02)
   goals met: 0 of 4
4. (op_1 obj_12 obj_06 obj_07)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_07)
   goals met: 0 of 4
5. (op_2 obj_12 obj_10 obj_07 obj_02)
   deleted: (pred_1 obj_12 obj_10 obj_02)
   added: (pred_3 obj_10 obj_07) (pred_2 obj_12 obj_02)
   goals met: 1 of 4
6. (op_1 obj_12 obj_07 obj_03)
   deleted: (pred_4 obj_12 obj_07)
   added: (pred_4 obj_12 obj_03)
   goals met: 1 of 4
7. (op_3 obj_12 obj_14 obj_03 obj_02)
   deleted: (pred_3 obj_14 obj_03) (pred_2 obj_12 obj_02)
   added: (pred_1 obj_12 obj_14 obj_02)
   goals met: 1 of 4
8. (op_1 obj_12 obj_03 obj_06)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_06)
   goals met: 1 of 4
9. (op_2 obj_12 obj_14 obj_06 obj_02)
   deleted: (pred_1 obj_12 obj_14 obj_02)
   added: (pred_3 obj_14 obj_06) (pred_2 obj_12 obj_02)
   goals met: 2 of 4
10. (op_1 obj_12 obj_06 obj_03)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_03)
   goals met: 2 of 4
11. (op_3 obj_12 obj_11 obj_03 obj_02)
   deleted: (pred_3 obj_11 obj_03) (pred_2 obj_12 obj_02)
   added: (pred_1 obj_12 obj_11 obj_02)
   goals met: 2 of 4
12. (op_1 obj_12 obj_03 obj_06)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_06)
   goals met: 2 of 4
13. (op_2 obj_12 obj_11 obj_06 obj_02)
   deleted: (pred_1 obj_12 obj_11 obj_02)
   added: (pred_3 obj_11 obj_06) (pred_2 obj_12 obj_02)
   goals met: 3 of 4
14. (op_2 obj_05 obj_09 obj_06 obj_01)
   deleted: (pred_1 obj_05 obj_09 obj_01)
   added: (pred_3 obj_09 obj_06) (pred_2 obj_05 obj_01)
   goals met: 3 of 4
15. (op_3 obj_12 obj_09 obj_06 obj_02)
   deleted: (pred_3 obj_09 obj_06) (pred_2 obj_12 obj_02)
   added: (pred_1 obj_12 obj_09 obj_02)
   goals met: 3 of 4
16. (op_1 obj_12 obj_06 obj_03)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_03)
   goals met: 3 of 4
17. (op_2 obj_12 obj_09 obj_03 obj_02)
   deleted: (pred_1 obj_12 obj_09 obj_02)
   added: (pred_3 obj_09 obj_03) (pred_2 obj_12 obj_02)
   goals met: 4 of 4
